<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Allgemeine Einstellungen vornehmen</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta name="AppleOrder" content="2" />
<link href="mbshelp.css" rel="stylesheet" type="text/css" />
</head>

<body>
<table width="100%">
  <tr>
    <td width="100"><img src="Images/HWIcon48.png" alt="Hardwaremonitor" width="48" height="48" /><img src="Images/TMIcon48.png" alt="Temperaturmonitor" width="48" height="48" /></td>
    <td><h1>Allgemeine Einstellungen vornehmen</h1></td>
  </tr>
</table>
<h2>Allgemeine Einstellungen</h2>
<p>Um die Arbeitsweise des Programms Ihren pers&ouml;nlichen Vorlieben anpassen
  zu k&ouml;nnen, lassen sich zahlreiche Einstellungen und Anpassungen vornehmen.
  Sie k&ouml;nnen diese Vorgaben im Hauptmen&uuml; unter dem Men&uuml;punkt <cite>Einstellungen&#8230;</cite> erreichen
  oder indem Sie die Tastenkombination <kbd>⌘</kbd>+<kbd>,</kbd> dr&uuml;cken.
Die Einstellungen sind in acht Rubriken unterteilt, die in diesem Handbuch sp&auml;ter
  noch ausf&uuml;hrlich erl&auml;utert werden. Die grunds&auml;tzlichen Einstellungen,
  die unabh&auml;ngig
von dem Computer sind, auf dem Sie das Programm gerade laufen lassen, werden
in der Rubrik <cite>Allgemein</cite> vorgenommen.</p>
<p>Mit dem Klappmen&uuml; <cite>Temperatureinheit</cite> w&auml;hlen Sie aus,
  welche Ma&szlig;einheit das Programm zur Ausgabe von Temperaturdaten verwenden
  soll. Sie k&ouml;nnen w&auml;hlen zwischen:</p>
<ul>
  <li>Grad Celsius</li>
  <li>Grad Fahrenheit</li>
  <li>Kelvin</li>
  <li>Kombination aus Celsius und Fahrenheit</li>
  <li>Kombination aus Fahrenheit und Celsius</li>
</ul>
<p class="infocell"><strong>Hinweis:</strong> Eine Kombination aus mehreren Ma&szlig;einheiten wird in der grafischen Darstellung und beim Export von Verlaufswerten nicht unterst&uuml;tzt. In diesem Fall wird die erste Ma&szlig;einheit der Kombination verwendet.</p>
<p>Beim Start des Programms muss die Sensorausstattung Ihres Computers ermittelt
  werden, was je nach den Hardware-Geräten, die Sie verwenden und der Anzahl
  der zusätzlichen Computer, die Sie fernüberwachen, eine längliche Aufgabe sein
  kann. Das Programm zeigt einen Wartehinweis in einem kleinen Fenster an, während
  die notwendigen Vorbereitungen ablaufen. Sobald das Fenster verschwindet, ist
  das Programm voll betriebsbereit. Falls Sie solche Fenster nicht mögen, können
Sie es mit einem Häkchen bei <cite>Begrüßungsfenster: Wartemeldung beim Start
des Programms unterdrücken</cite> abschalten.</p>
<p>Die Einstellung <cite>Graphanzeige</cite> w&auml;hlt aus, in welcher Form die  Skala f&uuml;r
  die senkrechte Achse von Verlaufsgrafiken dargestellt werden soll. Die Auswahl <cite>Nat&uuml;rliche Skala verwenden</cite> l&auml;sst die Achse grunds&auml;tzlich
  bei Null beginnen. Die Auswahl <cite>Auf aktuellen Wertebereich vergr&ouml;&szlig;ern</cite> zeigt
  die Grafik so an, dass der Messbereich, der im Verlauf sichtbar wird, automatisch
  so vergr&ouml;&szlig;ert wird, dass er 90 Prozent der H&ouml;he der Grafik einnimmt. Hierdurch werden kleine Details besser sichtbar, diese Darstellung kann jedoch dazu verleiten, kleine Ver&auml;nderungen und Messfehler zu &uuml;berinterpretieren.</p>
<p>Normalerweise werden Zeitwerte auf den horizontalen Achsen der Verlaufsgraphen
  mit relativen Bezeichnungen wie z.B. &quot;42 Minuten fr&uuml;her&quot; angezeigt. Sie k&ouml;nnen
  alternativ absolute Zeitangaben wie &quot;14:42:15&quot; anzeigen lassen, indem Sie die
  Auswahl <cite>Absolute Zeitangaben verwenden</cite> ankreuzen.</p>
<p>Zwei Wahlm&ouml;glichkeiten sind im Bereich <cite>Fern&uuml;berwachung</cite> verf&uuml;gbar:</p>
<ul><li>Die Option<cite> Verbindung mit zuvor verbundenen Computern wiederherstellen</cite> steuert,
      ob das Programm automatisch den gleichen Satz von fern&uuml;berwachten Computern
      kontaktieren soll, der bei der letzten Verwendung des Programms verbunden
    war, wenn Sie es beim n&auml;chsten Mal starten. Ohne dass ein weiterer Benutzereingriff
      n&ouml;tig ist, werden die gleichen Computer, die vorher in Benutzung waren,
    wieder verbunden. Beachten Sie, dass die fernen Computer eingeschaltet sein
    m&uuml;ssen und sich nicht im Ruhezustand befinden d&uuml;rfen, damit das Wiederherstellen
    der Verbindung erfolgreich ist. Sie erhalten keine Warnung wenn der Versuch
    fehlschl&auml;gt.</li>
  <li>Setzen Sie das H&auml;kchen bei <cite>Nicht benachrichtigen wenn Ferncomputer
        in Ruhezustand gehen</cite>, falls Sie keine Warnung erhalten m&ouml;chten,
        sobald das Programm den Kontakt zu einem fern&uuml;berwachten Computer
        verliert, weil dieser in den Ruhezustand gegangen ist.</li>
</ul>
<p>Die Einstellung Akkustrom ist nur f&uuml;r Hardwaremonitor verf&uuml;gbar. Sie wird
  in Temperaturmonitor nicht angezeigt. Die Auswahl steuert, welcher Vorgehensweise
  das Programm folgen soll, wenn Amp&egrave;re-Werte f&uuml;r Akkueinheiten angezeigt oder
  aufgezeichnet werden. Einige Versionen von Mac OS X und bestimmte Batterieeinheiten
  erlauben, dass das Vorzeichen des Stromwertes angibt, ob der Akku gerade geladen
  oder entladen wird. Ein Strom von 1,5 Ampere wird beispielsweise als 1,5A
  angezeigt, wenn er vom Akku in den Computer flie&szlig;t und als -1,5A wenn der gleiche
  Strom in die entgegengesetzte Richtung vom Computer in den Akku flie&szlig;t. Dr&uuml;cken
  Sie den Knopf bei <cite>F&uuml;r Akkustr&ouml;me immer positive Zahlen verwenden</cite>, wenn Sie
  sicherstellen m&ouml;chten, dass die Werte immer gr&ouml;&szlig;er als 0 sind. Treffen Sie
  die Auswahl <cite>Unterschiedliche Vorzeichen bei Laden/Entladen wenn m&ouml;glich</cite>, falls
  Sie einen Vorzeichenwechsel zulassen m&ouml;chten. Beachten Sie, dass einige Akkus
  und &auml;ltere Versionen von Mac OS X dies nicht unterst&uuml;tzen k&ouml;nnen. </p>
<p>Mit den Schiebereglern unter <cite>Aktualisierungsintervall</cite> k&ouml;nnen
  Sie steuern, wie oft das Programm neue Messungen durchf&uuml;hren soll. Dies
  beeinflusst auch die Darstellung der aktuellen Werte. Die Zeitdauer kann in
  verschiedenen Stufen zwischen einer Messung pro Sekunde und einer Messung pro
  Stunde ausgew&auml;hlt
  werden. Der empfohlene Wert liegt bei einem Intervall von 2 Sekunden.</p>
<p>Noch einmal hiervon getrennt kann die Abfrage der Festplattensensoren gesteuert werden. Da einige Festplatten kurzzeitig in einen Diagnosemodus gehen und eventuell die Schreib-/Lesek&ouml;pfe bewegen, wenn die Sensoren abgefragt werden, ist es nicht zu empfehlen, ein zu kurzes Abfrageintervall zu verwenden. Ansonsten kann es passieren, dass durch st&auml;ndiges Abfragen der Messwerte die Leistung Ihrer Festplatte(n) herabgesetzt wird.</p>
<p>Beachten Sie, dass der Zugriff auf Plattensensoren, die in die Laufwerke selbst
  eingebaut sind, von den Laufwerken als &quot;Benutzeraktivit&auml;t&quot; interpretiert wird.
  Wenn Sie den Ruhezustand f&uuml;r Festplatten in Mac OS X eingeschaltet haben, kann
  die &Uuml;berwachung dieser Sensoren dazu f&uuml;hren, dass die Laufwerke nicht
  mehr wie erwartet in den Ruhezustand gehen. Aus diesem Grund enth&auml;lt das Programm
  eine <cite>Plattenschoner</cite>-Funktion: Sobald Sie inaktiv sind und Ihren
  Computer f&uuml;r einen gewissen Zeitraum nicht benutzen, kann das Programm automatisch
  die Sensorkommunikation mit allen Laufwerken stoppen. Hierdurch kann die
  normale Ruhezustandsfunktion der Festplatten aktiv werden. Setzen Sie das Klappmen&uuml;
  bei <cite>Plattenschoner</cite> auf das gew&uuml;nschte Zeitintervall.</p>
<p class="infocell">Die Plattenschonerfunktion des Programms arbeitet absichtlich unabh&auml;ngig von
  Ihren pers&ouml;nlichen Energiespareinstellungen f&uuml;r Mac OS X. </p>
<p align="center"><img src="Images/PrefGeneral.png" alt="Hardwaremonitor Einstellungen" width="620" height="539" /></p>
<h2>Speichern von Anzeigemodus und Fensterpositionen</h2>
<p>Neben den allgemeinen Einstellungen speichert das Programm automatisch  ab, welche Fenstertypen und anderen Ausgabearten Sie zur Darstellung der Messwerte verwenden. Hierin ist auch die Position aller Fenster auf dem Schirm enthalten. Sie brauchen sich um diese Einstellungen nicht zu k&uuml;mmern. Beim n&auml;chsten Start des Programms wird automatisch versucht, wieder exakt den  Stand herzustellen, den Sie bei der letzten Benutzung des Programms hatten.</p>
<h2>Maschinenbezogene Einstellungen im Netzwerk</h2>
<p>Falls Sie das Monitorprogramm als &quot;roamender Benutzer&quot; auf verschiedenen Computern in einem Netzwerk einsetzen und sich Ihr privater Ordner auf einem gemeinsamen Dateiserver befindet (dies ist die normale Vorgehensweise in gro&szlig;en Firmen und Schulen), ist die Software in der Lage, sich die Einstellungen f&uuml;r jeden von Ihnen benutzten Computer und Computertyp zu merken.</p>
<ul>
  <li>Starten Sie das Programm sp&auml;ter wieder auf exakt dem gleichen Computer (mit der gleichen Sensorausstattung), so verwendet das Programm automatisch Ihre bereits getroffenen Einstellungen.</li>
  <li>Starten Sie das Programm sp&auml;ter auf einem &auml;hnlichen Computer (von der gleichen Bauart, mit einer vielleicht identischen, aber vielleicht auch abweichenden Sensorausstattung), so werden Sie automatisch gefragt, ob Sie eventuell bereits getroffene Einstellungen von einem anderen Computer &uuml;bernehmen m&ouml;chten. Es wird eine Liste der vorhandenen Einstellungen und Computer angezeigt. Sie k&ouml;nnen die &Uuml;bernahme der Werte auch ablehnen und auf diesem Computer mit einer frischen Standardeinstellung beginnen.</li>
  <li>Starten Sie das Programm auf einem Computer einer Bauart, auf dem Sie es vorher noch nie gestartet hatten, so erhalten Sie automatisch einen frischen Satz von Einstellungen (denn die Sensorausstattung wird wahrscheinlich erheblich von der Ausstattung anderer Computer abweichen). Bereits gespeicherte Einstellungen f&uuml;r andere Computermodelle gehen hierbei nicht verloren.</li>
</ul>
<p class="infocell">Die Einstellungen in <cite>Allgemein</cite> und <cite>Sensoren</cite> gelten
  global f&uuml;r alle Ihre Computer, alle anderen Pr&auml;ferenzbereiche werden f&uuml;r jeden
  Computer, zwischen dem Sie wechseln, individuell gespeichert. </p>
<hr />
<p><a href="index.html">Inhaltsverzeichnis</a></p>
<p>&nbsp;</p>
</body>
</html>
