<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Mit der Sprachausgabe arbeiten</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta name="AppleOrder" content="5" />
<link href="mbshelp.css" rel="stylesheet" type="text/css" />
</head>

<body>
<table width="100%">
  <tr>
    <td><img src="Images/HWIcon48.png" alt="Hardwaremonitor" width="48" height="48" /><img src="Images/TMIcon48.png" alt="Temperaturmonitor" width="48" height="48" /></td>
    <td><h1>Mit der Sprachausgabe arbeiten</h1></td>
  </tr>
</table>
<p>Das Monitorprogramm kann auf Wunsch Sensordaten auch akustisch, per Sprachausgabe, melden. Hierbei kann zwischen zwei verschiedenen Betriebsarten gew&auml;hlt werden:</p>
<ul>
  <li>Die Sprachausgabe erfolgt jedes Mal, sobald irgendeiner der Sensoren, die
    f&uuml;r Sprachausgabe konfiguriert sind, seinen Wert seit dem letzten Messintervall
    ver&auml;ndert hat. Auf Wunsch k&ouml;nnen Sie auch einen Schwellwert angeben,
    bis zu dem eine Messwertdifferenz noch nicht als &Auml;nderung interpretiert wird. </li>
  <li>Die Sprachausgabe k&uuml;ndigt die Werte in regelm&auml;&szlig;igen Zeitabst&auml;nden
    an. Die Zeitabst&auml;nde sind einstellbar und stellen Vielfache des eingestellten
    Messintervalls dar.</li>
</ul>
<p>In beiden F&auml;llen liest die Sprachausgabe alle Sensorwerte vor, die als
  sprechend konfiguriert sind. Die Auswahl erfolgt mit dem Punkt <cite>Betriebsart</cite> in
  der Rubrik <cite>Sprache</cite> des <a href="prefs.html">Einstellungsfensters</a>.
  Durch Ankreuzen des Feldes <cite>Sensornamen sprechen</cite> werden neben den
  Messdaten auch die englischen Sensorbezeichnungen genannt, wie Sie sie in der
  <a href="output.html">Rubrik Sensoren</a> definiert haben.</p>
<p align="center"><img src="Images/PrefSpeech.png" alt="Sprache" width="620" height="538" /></p>
<p class="infocell">Mac OS X unterst&uuml;tzt momentan nur englische Sprachausgabe, egal welche Sprache Sie in <cite>Systemeinstellungen</cite> als Pr&auml;ferenz angegeben haben. Die Messwerte werden grunds&auml;tzlich ohne Einheiten genannt. Stimme und sonstige Charakteristik der Sprachausgabe k&ouml;nnen Sie mit dem Punkt <cite>Sprache</cite> in <cite>Systemeinstellungen</cite> steuern.</p>
<p>Um festzulegen, welche Sensoren gesprochen werden sollen, verwenden Sie die Tabelle in der unteren H&auml;lfte des Fensters. Sie wird bedient, wie bereits <a href="output.html">obenstehend</a> beschrieben.</p>
<p class="infocell">Sie sollten es vermeiden, das Zeitintervall f&uuml;r Sprachausgabe zu kurz oder die Anzahl der sprechenden Sensoren zu hoch einzustellen. In diesen F&auml;llen k&ouml;nnte die n&auml;chste Sprachausgabe bereits beginnen, w&auml;hrend die laufende Ausgabe noch nicht beendet ist. Die Sprachfunktion unterbricht sich hierdurch st&auml;ndig selbst und Sie werden nichts verstehen.</p>
<h2>Sprachausgabe vollst&auml;ndig ein- und ausschalten</h2>
<p>Sie k&ouml;nnen die Sprachausgabe bei Bedarf vollst&auml;ndig ein- und ausschalten, ohne Einzeleinstellungen &auml;ndern zu m&uuml;ssen. Beim ersten Start des Monitorprogramms ist die Sprachausgabe standardm&auml;&szlig;ig abgeschaltet. Die Einstellung der Betriebsart erfolgt im Men&uuml; <cite>Monitor</cite>:</p>
<ul>
  <li><cite>Monitor &gt; Sprachausgabe (Englisch) &gt; Sensorwerte sprechen:</cite> gibt die Sprachausgabe der Messwerte und die Ausgabe von Alarmmeldungen frei.</li>
  <li><cite>Monitor &gt; Sprachausgabe (Englisch) &gt; Nur Alarme sprechen:</cite> schaltet die Sprachausgabe der Messwerte ab, erlaubt aber die sprechende Ausgabe von Alarmmeldungen.</li>
  <li><cite>Monitor &gt; Sprachausgabe (Englisch) &gt; Sprachausgabe abschalten:</cite> verbietet die Sprachausgabe komplett.</li>
</ul>
<hr />
<p><a href="index.html">Inhaltsverzeichnis</a></p>
</body>
</html>
